content-org/writing.org
# -*- eval: (org-hugo-auto-export-mode 1); -*-
#+hugo_base_dir: ../
#+hugo_secton: /
#+hugo_front_matter_format: yaml
#+STARTUP: logdone
#+PROPERTY: header-args:R :session *R* :exports both :colnames yes :eval never-export :results value

** Mapping MIDI Channels to Multiple Instruments in SuperCollider
:PROPERTIES:
:EXPORT_FILE_NAME: midi-channels-multiple-instruments-supercollider
:EXPORT_HUGO_ALIASES: acoustics/midi-channels-multiple-instruments-supercollider
:END:
Being able to [[/notes/midi-instrument-control-supercollider/][control a polyphonic instrument in MIDI]] is
good, but being able to control multiple instruments is even
better. SuperCollider offers a lot of flexibility when it comes to
timbre. For my personal workflow, I like to try out a lot of different
sounds to see what best in the mix. Thus when thinking about how I
want to use the MIDI controller in connection with SuperCollider, it
makes sense to me to be able to switch between instruments fluidly.
*** Finding some sounds
If you do not want to start from scratch, there are a number of excellent
resources for finding SuperCollider =SynthDef=s:

+ [[http://github.com/][GitHub]] is a service that hosts millions of software projects created
  and maintained by developers around the world. The source code for
  [[https://github.com/supercollider/supercollider][SuperCollider]] itself is hosted on GitHub in addition to [[https://github.com/search?utf8=%E2%9C%93&q=language%3ASuperCollider&type=Repositories&ref=advsearch&l=SuperCollider&l=][hundreds of
  other projects]] written in the SuperCollider language.
+ [[http://sccode.org/][SuperCollider Code]] is a community-driven website which allows users
  to post snippets of their SuperCollider code. These snippets use
  tagging, which makes it easy to search for specific timbres.  The
  website also hosts the [[http://doc.sccode.org/][SuperCollider documentation]].
+ [[https://patchstorage.com/platform/supercollider/][patchstorage]] has a few SuperCollider patches, but seems to have
  rather limited activity currently.
  
To start, I copied a few =SynthDefs=:

+ The first channel is for the simple sine wave =SynthDef=.
+ I attached the second channel to a [[http://sccode.org/1-51p][piano]] =SynthDef= which uses
  =MdaPiano=, a generator provided by [[https://github.com/supercollider/sc3-plugins][=sc3-plugins=]].
+ The third channel provides an Electric Piano timber found on
  [[http://sccode.org/1-522][sccode.org]].
+ The fourth channel is used for an [[https://github.com/patrickmcminn/beatles/blob/2f6119165f51f8d3f885aca22b332133d010d234/source/system/SynthDefs/Synth%20SynthDefs/additive.scd][organ instrument]] meant to emulate
  a classic Hammond organ.
  
I considered these sounds to be a good starting point for emulating
many classic keyboard instruments.
*** Switching instruments
To allow these different timbres to be selected, I made a few changes
to the function defined in the [[https://carlcolglazier.com/notes/starting-supercollider/][previous post]]. First, I created a second array with sixteen elements to hold
the names of the different `SynthDef`s.

#+BEGIN_SRC sc
// https://gist.github.com/umbrellaprocess/973d2aa16e95bf329ee2
var keys, instruments;
keys = Array.newClear(128);

instruments = Array.newClear(16);
instruments.put(0, \sinpk);
instruments.put(1, \piano);
instruments.put(2, \rhodey_sc);
instruments.put(3, \hammond);
#+END_SRC

I then modified the =NoteOn= function such that the correct instrument
is selected based on its position in the `instruments` array.

#+BEGIN_SRC sc
~noteOnFunc = {arg val, num, chan, src;
	var node;
	node = keys.at(num);
	if (node.notNil, {
		node.release;
		keys.put(num, nil);
	});
	node = Synth(instruments.at(chan), [\freq, num.midicps, \vel, val]);
	[num, chan].postln;
	keys.put(num, node);
};
#+END_SRC


Now I could select the appropriate instrument by simply changing the MIDI
channel on my controller.
*** A quick demo
Putting it all together, I created a simple track to demonstrate these
different timbers (accompanied with some mandolin):

<audio src="/audio/sc-demo.mp3" controls class="scope">
</audio>
<script type="text/javascript" src="/js/oscilloscope.min.js"></script>

---

The [[/notes/starting-supercollider/][past]] [[/notes/midi-in-supercollider/][few]] [[/notes/midi-instrument-control-supercollider/][posts]] have worked through some building blocks for using
SuperCollider as a platform for creativity. As I wrote in [[/notes/acoustics/paradox-of-creativity/]["The Paradox
of Creativity"]], I find the creative process to be best when applied to
areas that are challenging. I believe it is for this reason that I
find SuperCollider to be such an interesting platform: it provides the
pieces for expansive sonic possibilities, but it takes a bit of effort
and curiosity to make the most of it.
